design_model/src/main/resources/结构型模式/适配器模式/双向适配器模式.md
```mermaid
classDiagram
    class Adaptee {
        +specificRequest()*
    }
    class Target {
        +request()*
    }
    class ConcreteAdaptee {
        +specificRequest()
    }
    class ConcreteTarget {
    }
    class Adapter {
        -Adaptee adaptee
        -Target target
        +Adapter(Target target)
        +Adapter(Adaptee adaptee)
        +request()
        +specificRequest()
    }
    note for Adapter "target.request(),\nadaptee.specificRequest();" 
    Adapter --|> Adaptee
    Adapter --|> Target
    Adapter --> Adaptee
    Adapter --> Target
    ConcreteAdaptee --|> Adaptee
    ConcreteTarget --|> Target
```
